# astype(int)

In [37]:
import pandas as pd
import numpy as np

# Sample DataFrame with object columns
df = pd.DataFrame({'A': ['1', '2', '3'],
                   'B': ['1.1', '2.2', '3.3'],
                   'C': ['2022-01-01', '2022-01-02', '2022-01-03'],
                   'D': ['foo', 'bar', 'baz']})

In [38]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      object
 1   B       3 non-null      object
 2   C       3 non-null      object
 3   D       3 non-null      object
dtypes: object(4)
memory usage: 228.0+ bytes

In [39]:
df = df.astype({'A': 'int','B': 'float','C': 'datetime64[ns]'})

In [40]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      int32
 1   B       3 non-null      float64
 2   C       3 non-null      datetime64[ns]
 3   D       3 non-null      object
dtypes: datetime64[ns](1), float64(1), int32(1), object(1)
memory usage: 216.0+ bytes

# pd.to_numeric()  
# pd.to_datetime()    
# pd.to_datetime()

In [84]:
df2 = pd.DataFrame({'A': ['1', '2', None],
                   'B': ['1.1', '2.2', np.nan],
                   'C': ['2022-01-01', '2022-01-02', ''],
                   'D': ['foo', 'bar', 'baz']})

In [85]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       2 non-null      object
 1   B       2 non-null      object
 2   C       3 non-null      object
 3   D       3 non-null      object
dtypes: object(4)
memory usage: 228.0+ bytes

In [86]:
# convert to ineteger. to_numeric default converst to float if we need to convert to ineteger we need to convert None, NaN to zero's
# df2 = df2.astype({'A': 'int'})
df2['A'] = pd.to_numeric(df2['A'])

In [87]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       2 non-null      float64
 1   B       2 non-null      object
 2   C       3 non-null      object
 3   D       3 non-null      object
dtypes: float64(1), object(3)
memory usage: 228.0+ bytes

In [88]:
df2

     A    B           C    D
0  1.0  1.1  2022-01-01  foo
1  2.0  2.2  2022-01-02  bar
2  NaN  NaN              baz

In [89]:
df2['A'] = df2['A'].fillna(0).astype(int)

In [90]:
df2

   A    B           C    D
0  1  1.1  2022-01-01  foo
1  2  2.2  2022-01-02  bar
2  0  NaN              baz

In [91]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      int32
 1   B       2 non-null      object
 2   C       3 non-null      object
 3   D       3 non-null      object
dtypes: int32(1), object(3)
memory usage: 216.0+ bytes

In [92]:
df2['B'] = pd.to_numeric(df2['B'])

In [93]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      int32
 1   B       2 non-null      float64
 2   C       3 non-null      object
 3   D       3 non-null      object
dtypes: float64(1), int32(1), object(2)
memory usage: 216.0+ bytes

In [94]:
df2

   A    B           C    D
0  1  1.1  2022-01-01  foo
1  2  2.2  2022-01-02  bar
2  0  NaN              baz

In [95]:
df2['C'] = pd.to_datetime(df2['C'])

In [96]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      int32
 1   B       2 non-null      float64
 2   C       2 non-null      datetime64[ns]
 3   D       3 non-null      object
dtypes: datetime64[ns](1), float64(1), int32(1), object(1)
memory usage: 216.0+ bytes

In [97]:
df2

   A    B          C    D
0  1  1.1 2022-01-01  foo
1  2  2.2 2022-01-02  bar
2  0  NaN        NaT  baz